balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1513.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="AADRES1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="AADRES1H" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADRES1H" edc:desc="" edc:mask="0xff" edc:name="ADRES1H" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="15" edc:beginaddr="0x780" edc:endaddr="0x7F0" edc:regionid="sfr15">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="16" edc:beginaddr="0x800" edc:endaddr="0x820" edc:regionid="sfr16">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="17" edc:beginaddr="0x880" edc:endaddr="0x8a0" edc:regionid="sfr17">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="18" edc:beginaddr="0x900" edc:endaddr="0x920" edc:regionid="sfr18">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="19" edc:beginaddr="0x980" edc:endaddr="0x9a0" edc:regionid="sfr19">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="20" edc:beginaddr="0xa00" edc:endaddr="0xa20" edc:regionid="sfr20">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="21" edc:beginaddr="0xa80" edc:endaddr="0xaa0" edc:regionid="sfr21">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="22" edc:beginaddr="0xb00" edc:endaddr="0xb20" edc:regionid="sfr22">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="23" edc:beginaddr="0xb80" edc:endaddr="0xba0" edc:regionid="sfr23">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="24" edc:beginaddr="0xc00" edc:endaddr="0xc20" edc:regionid="sfr24">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="25" edc:beginaddr="0xc80" edc:endaddr="0xca0" edc:regionid="sfr25">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="26" edc:beginaddr="0xd00" edc:endaddr="0xd20" edc:regionid="sfr26">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="27" edc:beginaddr="0xd80" edc:endaddr="0xda0" edc:regionid="sfr27">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="28" edc:beginaddr="0xe00" edc:endaddr="0xe20" edc:regionid="sfr28">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="29" edc:beginaddr="0xe80" edc:endaddr="0xea0" edc:regionid="sfr29">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="30" edc:beginaddr="0xf00" edc:endaddr="0xf20" edc:regionid="sfr30">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="31" edc:beginaddr="0xF80" edc:endaddr="0xFF0" edc:regionid="sfr31">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="88"/>
        <edc:SFRDef edc:access="-----nnn" edc:cname="STATUS_SHAD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----uuu" edc:name="STATUS_SHAD" edc:nzwidth="8" edc:por="-----xxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C_SHAD" edc:desc="" edc:mask="0x1" edc:name="C_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DC_SHAD" edc:desc="" edc:mask="0x1" edc:name="DC_SHAD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="Z_SHAD" edc:desc="" edc:mask="0x1" edc:name="Z_SHAD" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WREG_SHAD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="WREG_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG_SHAD" edc:desc="" edc:mask="0xff" edc:name="WREG_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="BSR_SHAD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---uuuuu" edc:name="BSR_SHAD" edc:nzwidth="8" edc:por="---xxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BSR_SHAD" edc:desc="" edc:mask="0x1f" edc:name="BSR_SHAD" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="PCLATH_SHAD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="PCLATH_SHAD" edc:nzwidth="8" edc:por="-xxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCLATH_SHAD" edc:desc="" edc:mask="0x7f" edc:name="PCLATH_SHAD" edc:nzwidth="7"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0L_SHAD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0L_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0L_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0L_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="FSR0H_SHAD" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="FSR0H_SHAD" edc:nzwidth="8" edc:por="xxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FSR0H_SHAD" edc:desc="" edc:mask="0xff" edc:name="FSR0H_SHAD" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
